ERM/src/Documents/NoteAllocation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>NoteAllocation</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.BilledAR</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedMemo</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
						<v8:Type>cfg:DocumentRef.Memo</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииNoteAllocation</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийNoteAllocation</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьMemo</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Memo</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModifiedBy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModificationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>CreditNotes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>CreditNote</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Location</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SubSubSegment</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Account</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AU</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/AccumulationRegisters/BilledAR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>BilledAR</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
						<v8:Type>cfg:DocumentRef.Memo</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERM/src/AccumulationRegisters/UnallocatedMemo.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>UnallocatedMemo</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Memo</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERM/src/Enums/ВидыОперацийNoteAllocation/ВидыОперацийNoteAllocation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийNoteAllocation</name>
  <enumValues>
    <name>CreditNote</name>
  </enumValues>
  <enumValues>
    <name>CreditMemo</name>
  </enumValues>
  <enumValues>
    <name>DebitMemo</name>
  </enumValues>
</mdclass:Enum>

ERM/src/Documents/NoteAllocation/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ВидОперацииNoteAllocation = Перечисления.ВидыОперацийNoteAllocation.ПустаяСсылка() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Select the operation type before recording.");
		
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		
		Ответственный = Пользователи.ТекущийПользователь();
		
	Иначе
		
		ModifiedBy = Пользователи.ТекущийПользователь();
		ModificationDate = ТекущаяДата();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СтруктураКурсаInvoice = РаботаСКурсамиВалют.ПолучитьВнутреннийКурсВалюты(Currency, Дата);
	
	Если ВидОперацииNoteAllocation = Перечисления.ВидыОперацийNoteAllocation.CreditNote Тогда
		Клиент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Invoice, "Client");
		//СтруктураКурсаInvoice = РаботаСКурсамиВалют.ПолучитьВнутреннийКурсВалюты(Currency, Дата);
		
		ДвиженияBilledAR = Движения.BilledAR;
		
		Для каждого СтрокаТЧ Из CreditNotes Цикл
			
			ДвижениеCreditNote = ДвиженияBilledAR.Добавить();
			ДвижениеInvoice = ДвиженияBilledAR.Добавить();
			
			СтруктураКурсаCreditNote = РаботаСКурсамиВалют.ПолучитьВнутреннийКурсВалюты(СтрокаТЧ.Currency, Дата);
			
			ДвижениеCreditNote.Период = Дата;
			ДвижениеCreditNote.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеCreditNote.Client = Клиент;
			ДвижениеCreditNote.Company = СтрокаТЧ.Company;
			ДвижениеCreditNote.Source = Source;
			ДвижениеCreditNote.Location = СтрокаТЧ.Location;
			ДвижениеCreditNote.SubSubSegment = СтрокаТЧ.SubSubSegment;
			ДвижениеCreditNote.Invoice = СтрокаТЧ.CreditNote;
			ДвижениеCreditNote.Account = СтрокаТЧ.Account;
			ДвижениеCreditNote.Currency = СтрокаТЧ.Currency;
			ДвижениеCreditNote.AU = СтрокаТЧ.AU;
			ДвижениеCreditNote.Amount = -СтрокаТЧ.Amount;
			ДвижениеCreditNote.BaseAmount = -СтрокаТЧ.Amount / ?(ЗначениеЗаполнено(СтруктураКурсаCreditNote.Курс), СтруктураКурсаCreditNote.Курс, 1);
			
			ДвижениеInvoice.Период = Дата;
			ДвижениеInvoice.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеInvoice.Client = Клиент;
			ДвижениеInvoice.Company = Company;
			ДвижениеInvoice.Source = Source;
			ДвижениеInvoice.Location = Location;
			ДвижениеInvoice.SubSubSegment = SubSubSegment;
			ДвижениеInvoice.Invoice = Invoice;
			ДвижениеInvoice.Account = Account;
			ДвижениеInvoice.Currency = Currency;
			ДвижениеInvoice.AU = AU;
			ДвижениеInvoice.Amount = -ДвижениеCreditNote.Amount;
			ДвижениеInvoice.BaseAmount = -ДвижениеCreditNote.BaseAmount;
			
		КонецЦикла;
		
		ДвиженияBilledAR.Записывать = Истина;
		
	ИначеЕсли ВидОперацииNoteAllocation = Перечисления.ВидыОперацийNoteAllocation.CreditMemo Тогда
	
		ДвиженияUnallocatedMemo = Движения.UnallocatedMemo;
		ДвиженияBilledAR = Движения.BilledAR;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	UnallocatedMemoОстатки.AmountОстаток,
			|	UnallocatedMemoОстатки.BaseAmountОстаток
			|ИЗ
			|	РегистрНакопления.UnallocatedMemo.Остатки(&ПериодОстатки, Memo = &Memo) КАК UnallocatedMemoОстатки";
		
		Запрос.УстановитьПараметр("Memo", Invoice);
		Запрос.УстановитьПараметр("ПериодОстатки", Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			ДвижениеUnallocated = ДвиженияUnallocatedMemo.Добавить();
			ЗаполнитьЗначенияСвойств(ДвижениеUnallocated, Invoice);
			ДвижениеUnallocated.Период = Дата;
			ДвижениеUnallocated.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеUnallocated.Memo = Invoice;
			ДвижениеUnallocated.Amount = ВыборкаДетальныеЗаписи.AmountОстаток;
			ДвижениеUnallocated.BaseAmount = ВыборкаДетальныеЗаписи.BaseAmountОстаток;
			
			ДвижениеBilledAR = ДвиженияBilledAR.Добавить();
			ЗаполнитьЗначенияСвойств(ДвижениеBilledAR, Invoice);
			ДвижениеBilledAR.Период = Дата;
			ДвижениеBilledAR.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвижениеBilledAR.Invoice = Invoice;
			ДвижениеBilledAR.Amount = ВыборкаДетальныеЗаписи.AmountОстаток;
			ДвижениеBilledAR.BaseAmount = ВыборкаДетальныеЗаписи.BaseAmountОстаток;
			
			//ДвиженияBilledAR.Записать();
			//ДвиженияUnallocatedMemo.Записать();
			
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
			//ругаемся
		КонецЕсли;
		
		
		ДвижениеBilledAR = ДвиженияBilledAR.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеBilledAR, Invoice);
		Amount = CreditNotes.Итог("Amount");
		ДвижениеBilledAR.Период = Дата;
		ДвижениеBilledAR.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеBilledAR.Invoice = Invoice;
		ДвижениеBilledAR.Amount = -Amount;
		ДвижениеBilledAR.BaseAmount = -Amount / ?(ЗначениеЗаполнено(СтруктураКурсаInvoice.Курс), СтруктураКурсаInvoice.Курс, 1);
		
		Для каждого СтрокаТЧ Из CreditNotes Цикл
			СтруктураКурсаCreditNote = РаботаСКурсамиВалют.ПолучитьВнутреннийКурсВалюты(СтрокаТЧ.Currency, Дата);
			ДвижениеBilledAR = ДвиженияBilledAR.Добавить();
			ЗаполнитьЗначенияСвойств(ДвижениеBilledAR, СтрокаТЧ.CreditNote);
			ДвижениеBilledAR.Период = Дата;
			ДвижениеBilledAR.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеBilledAR.Invoice = СтрокаТЧ.CreditNote;
			ДвижениеBilledAR.Amount = -СтрокаТЧ.Amount;
			ДвижениеBilledAR.BaseAmount = -СтрокаТЧ.Amount / ?(ЗначениеЗаполнено(СтруктураКурсаCreditNote.Курс), СтруктураКурсаCreditNote.Курс, 1);
		КонецЦикла;
		
		
		ДвиженияBilledAR.Записывать = Истина;
		ДвиженияUnallocatedMemo.Записывать = Истина;
		
	ИначеЕсли ВидОперацииNoteAllocation = Перечисления.ВидыОперацийNoteAllocation.DebitMemo Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	UnallocatedMemoОстатки.AmountОстаток,
			|	UnallocatedMemoОстатки.BaseAmountОстаток
			|ИЗ
			|	РегистрНакопления.UnallocatedMemo.Остатки(&ПериодОстатков, Memo = &Memo1) КАК UnallocatedMemoОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	UnallocatedMemoОстатки.AmountОстаток,
			|	UnallocatedMemoОстатки.BaseAmountОстаток
			|ИЗ
			|	РегистрНакопления.UnallocatedMemo.Остатки(&ПериодОстатков, Memo = &Memo2) КАК UnallocatedMemoОстатки";
		
		Запрос.УстановитьПараметр("Memo1", Invoice);
		Запрос.УстановитьПараметр("Memo2", Invoice);
		Запрос.УстановитьПараметр("ПериодОстатков", Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
